11/data/attachments/df03510c3d826419.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_f4971399-df5f-4e7f-b74a-985f2e00bdd3</nif:username>
            <nif:friendToBeAdded>Brian_themselves_Friend_75743_8</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>